{
	"name": "Генераторы и энергия",
	"category": "assemblylinemachines:blocks",
	"icon": "assemblylinemachines:combustion_generator",
	"pages": [
		{
			"type": "text",
			"text": "Этот раздел расскажет о доступных генераторах и хранилищах энергии."
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/crankmill",
			"text": "Предмет увеличивает мощность Коробки передач и конвертирует кинетическую энергию в электрическую. Для получения большей информации, ознакомтесь с $(l:age3)Электрической эрой."
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/coal_generator",
			"text": "Генератор преобразует все горючие материалы в электрическую энергию. Любой тип топлива будет гореть 60 секунд, а вот количество получаемой энергии сильно зависит от качества топлива."
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/basic_battery_cell",
			"text": "Батареи могут хранить до 2.5 MFE. Энергию можно забирать с любой стороны, кроме лицевой.$(p)Так же, батарея может принимать и отдавать энергию автономно. Скорость до 2 KFE/t."
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/geothermal_generator",
			"recipe2": "assemblylinemachines:crafting/combustion_generator"
		},
		{
			"type": "text",
			"text": "Эти генераторы одинаковы по своей сути. Они принимают жидкость. Различается лишь тип принимаемой жидкости.$(p)Генератор внутреннего сгорания поглощает продукты Нефти - Дизель и Бензин.$(p)Геотермальный генератор же принимает лаву."
		},
		{
			"type": "text",
			"text": "Чтобы получить Дизель и Бензин, необходимо залить Нефть в Разделитель перерабатывающего завода. Дизель и Бензин начнут производиться в соотношении 3:5. Для получения большей информации, ознакомтесь с $(l:age3)Электричекой эрой$()$(p)Представленные генераторы поддерживают Улучшение: Активное охлаждение."
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/upgrades/generator_upgrade_coolant",
			"title": "Активное охлаждение",
			"text": "Улучшение добавляет второй жидкостный резервуар, для хладагента.$(p)Вода повышает производительность в два раза. Конденсированная пустота - в 4."
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/naphtha_turbine",
			"text": "Данный предмет служит как улучшение для Угольного генератора, повышающее производительность. Тлеющий камень можно получить в Объединителе перерабатывающего завода, положив туда Булыжник и Лигроин."
		},
		{
			"type": "text",
			"text": "Поставьте турбину на Угольный генератор, а рядом с ней разлейте ведро Лигроина (убедитесь, что жидкость не утечёт!).$(p)После чего на Угольный генератор распылится Лигроиновый огонь, что даст х4 множитель производительности на следующий цикл.$(p)Лигроин можно редко найти в Аду."
		}
	]
}