{
	"name": "Фермы мобов",
	"category": "assemblylinemachines:blocks",
	"icon": "assemblylinemachines:interactor",
	"pages": [
		{
			"type": "text",
			"text": "В моде присутствует много возможностей упрощения фарма монстров и животных! Хотите их узнать? Читайте дальше."
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/interactor",
			"text": "У Интерактора есть четыре режима работы, полезных для автоматизации."
		},
		{
			"type": "text",
			"text": "Первый - Режим ломания. Очевидно, ломает блок перед собой выданным ему инструментом. Сломанный блок выбрасывается наружу.$(li)Второй - Режим взаимодействия. Интерактор будет эмулировать нажатие ПКМ по блоку перед ним. Все предметы, добавленные в \"инвентарь\" будут ставиться и исчезать после каждого цикла."
		},
		{
			"type": "text",
			"text": "$(li)Третий - Режим установки. Машина будет ставить блоки из внутреннего хранилища перед собой в рандомном или очередном порядке.$(li)Четвёртый - Режим атаки. Интерактор бьёт всех мобов в небольшом радиусе перед собой выданным ему оружием."
		},
		{
			"type": "spotlight",
			"item": "assemblylinemachines:mob_crystal",
			"anchor": "mobcrystal",
			"link_recipe": true,
			"text": "Инертный кристалл моба используется для настройки $(item)Электрического спавнера.$() Вам понадобится $(item)Полированный камень,$() крафтящийся в Очистителе из:$(li)Гладкого камня, Гравия и Песка.$()$(li)Затем, в Литейном заводе сплавьте его с Незеритовыми обломками и получите Кристалл."
		},
		{
			"type": "text",
			"text": "Далее, вам надо положить Кристалл себе в инвентарь и убить сущность $(item)Мистиевым мечом$(). Если повезёт, то Кристалл поглотит её и активируется.$(p)$(3)Важно: Необходимо активировать способность Мистиевого Меча! Для большей информации, ознакомтесь с разделом $(l:items/mystium_tools)Мистиевые инструменты.$()"
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/powered_spawner",
			"text": "Вставьте Активированный кристал моба в Электрический спавнер, запитайте, и он будет работать, как обычный!"
		},
		{
			"type": "text",
			"text": "В Электрический спавнер можно добавить $(item)Улучшение: Увеличение КПД. $()Благодаря нему за раз будет спавниться больше мобов!$(p)Так же можно добавить $(item)Улучшение: Скорость.$() Так мобы будут спавниться чаще."
		}
	]
}