{
	"name": "Карьер",
	"category": "assemblylinemachines:blocks",
	"icon": "assemblylinemachines:quarry",
	"pages": [
		{
			"type": "text",
			"text": "Карьер - многоблочная структура, позволяющая делать ОГРОМНЫЕ дыры и собирать ресурсы!"
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/quarry",
			"text": "Помимо самого карьера, вам необходимо подготовить склад, куда будут доставляться добытые предметы. И не забудьте запастить энергией!"
		},
		{
			"type": "text",
			"text": "Как только вы установите Карьер, появится терминал. В нём вы можете узнать о том, что мешает начать раскопки.$(p)Карьер будет копать в области указанного РАЗМЕРА вправа или влево. Сам блок карьера всегда будет на углу."
		},
		{
			"type": "image",
			"images": [
				"assemblylinemachines:textures/gui/patchouli/quarry_mine_zone.png"
			],
			"border": true,
			"title": "Зона раскопок",
			"text": "$(7)$(o)На картинке показан пример области 5х5 справа от Карьера."
		},
		{
			"type": "text",
			"text": "Карьер будет помещать добытое в сундук наверху, пока вся область не будет выкопана. После завершения работы можете перенести его куда угодно!$(p)По умолчанию, Карьер будет заменять выкопанные блоки на Землю.$(p)Карьер тоже можно улучшить."
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/quarry_addon_fortune",
			"text": "Удача увеличивает количество выпадающих ресурсов с руд по типу Лазуритовой и Угольной. $(p)Вы можете поставить несколько таких улучшений вокруг основного блока. Каждое улучшение увеличивает удачу на 1."
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/quarry_addon_speed",
			"text": "Улучшение: Скорость, очевидно, ускоряет работу Карьера. $(p)Каждый добавленный около Карьера блок увеличивает скорость в два раза."
		},
		{
			"type": "crafting",
			"recipe": "assemblylinemachines:crafting/quarry_void_addon",
			"text": "С Улучшением: Пустота Карьер перестанет ставить Землю, вместо разрушенных блоков. $(p)В отличие от других улучшений, установка нескольких таких ни на что не повлияет."
		}
	]
}